WcfServices/WsHttpUsername/UsernameScript/result1/Iteration1/t1355847895_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://tempuri.org/IUsernamePasswordService/EchoString</wsa:Action><wsa:MessageID>uuid:c7ec1eab-5033-4e58-a493-de606e150107</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://localhost:8731/Design_Time_Addresses/UsernameService/UsernamePasswordService/</wsa:To></soap:Header><soap:Body><EchoString xmlns="http://tempuri.org/"><s>abcde</s></EchoString></soap:Body></soap:Envelope>