WcfServices/WsHttpUsername/UsernameScript/result1/Iteration1/t1355847895_http.xml

<?xml-stylesheet href="..\http.xsl" type="text/xsl"?>
<report vuGenInstallDir="c:\Program Files (x86)\HP\LoadRunner\">
  <http>
    <request>
      <body>&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"&gt;
  &lt;soap:Header&gt;
    &lt;wsa:Action&gt;http://tempuri.org/IUsernamePasswordService/EchoString&lt;/wsa:Action&gt;
    &lt;wsa:MessageID&gt;uuid:c7ec1eab-5033-4e58-a493-de606e150107&lt;/wsa:MessageID&gt;
    &lt;wsa:ReplyTo&gt;
      &lt;wsa:Address&gt;http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous&lt;/wsa:Address&gt;
    &lt;/wsa:ReplyTo&gt;
    &lt;wsa:To&gt;http://localhost:8731/Design_Time_Addresses/UsernameService/UsernamePasswordService/&lt;/wsa:To&gt;
  &lt;/soap:Header&gt;
  &lt;soap:Body&gt;
    &lt;EchoString xmlns="http://tempuri.org/"&gt;
      &lt;s&gt;abcde&lt;/s&gt;
    &lt;/EchoString&gt;
  &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;</body>
    </request>
    <response>
      <body>&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"&gt;
  &lt;s:Body u:Id="_0"&gt;
    &lt;EchoStringResponse xmlns="http://tempuri.org/"&gt;
      &lt;EchoStringResult&gt;You entered: abcde !!!&lt;/EchoStringResult&gt;
    &lt;/EchoStringResponse&gt;
  &lt;/s:Body&gt;
&lt;/s:Envelope&gt;</body>
    </response>
  </http>
</report>